In [1]:
import pandas as pd

# Load data set

In [2]:
train_data = pd.read_csv(r"D:\Superior\3rd Semester\AI Lab\train.csv")
test_data = pd.read_csv(r"D:\Superior\3rd Semester\AI Lab\test.csv")
gender_submission = pd.read_csv(r"D:\Superior\3rd Semester\AI Lab\gender_submission.csv")

# Training dataset

In [3]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Display short summary of data

In [4]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# Check null values

In [5]:
train_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
train_data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

# Fill null with mean

In [7]:
train_data.fillna(train_data["Age"].mean(),inplace=True)

In [8]:
train_data["Age"].isnull().sum()

0

# Type casting

In [9]:
train_data["Age"].dtype

dtype('float64')

In [10]:
train_data["Age"] = train_data["Age"].astype(int)

In [11]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,29.699118,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,29.699118,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,29.699118,S

In [12]:
train_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.544332,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,13.013778,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,29.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,35.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [13]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    int32
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(1), int32(1), int64(5), object(5)
memory usage: 80.2+ KB

# Drop the unnecessary columns

In [14]:
drp_col_train = train_data.drop(columns=["PassengerId","Name","Ticket","Fare","Cabin"])

In [15]:
drp_col_train.sample(5)

     Survived  Pclass     Sex  Age  SibSp  Parch Embarked
606         0       3    male   30      0      0        S
812         0       2    male   35      0      0        S
499         0       3    male   24      0      0        S
46          0       3    male   29      1      0        Q
53          1       2  female   29      1      0        S

In [16]:
drp_col_train["Embarked"] = drp_col_train["Embarked"].astype(str)

In [17]:
drp_col_train["Embarked"] = drp_col_train["Embarked"].str.strip()

# Columns without target variable

In [18]:
X = drp_col_train.drop(columns="Survived")

# Target variable

In [19]:
Y = drp_col_train["Survived"]

In [20]:
print(f"The rows in X are {X.shape[0]} and columns are {X.shape[1]}.")
print(f"The rows in Y are {Y.shape[0]} and columns are {Y.shape}.")

The rows in X are 891 and columns are 6.
The rows in Y are 891 and columns are (891,).

In [21]:
X.dtypes

Pclass       int64
Sex         object
Age          int32
SibSp        int64
Parch        int64
Embarked    object
dtype: object

In [22]:
from sklearn.preprocessing import LabelEncoder

# Encoding

In [23]:
le = LabelEncoder()

X['Sex'] = le.fit_transform(X['Sex'])

In [24]:
X["Embarked"] = le.fit_transform(X["Embarked"])

In [25]:
Y.dtype

dtype('int64')

In [26]:
drp_col_train['Embarked'] = le.fit_transform(drp_col_train['Embarked'])
drp_col_train['Sex'] = le.fit_transform(drp_col_train['Sex'])

# Testing dataset

In [27]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# Display short summary of data

In [28]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.1+ KB

# Check null values

In [29]:
test_data.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

# Handling missing values

In [30]:
test_data["Age"].fillna(test_data["Age"].mean(),inplace=True)
test_data['Age'] = test_data['Age'].astype(int)

C:\Users\Aun Awan\AppData\Local\Temp\ipykernel_3480\884858591.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  test_data["Age"].fillna(test_data["Age"].mean(),inplace=True)

# Drop the unnecessary columns

In [31]:
drp_col = test_data.drop(columns=['PassengerId','Name','Ticket','Fare','Cabin'])

In [32]:
x_test = drp_col

In [33]:
x_test['Sex'] = le.fit_transform(x_test['Sex'])
x_test['Embarked'] = le.fit_transform(x_test['Embarked'])

# See the data types of column

In [34]:
x_test.dtypes

Pclass      int64
Sex         int32
Age         int32
SibSp       int64
Parch       int64
Embarked    int32
dtype: object

In [35]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          418 non-null    int32
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(1), int32(1), int64(4), object(5)
memory usage: 34.4+ KB

# Apply models

In [36]:
from sklearn.svm import SVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

# Standard Vector Classifier

In [37]:
gender_submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

# Objects

In [38]:
svc = SVC()
rfc = RandomForestClassifier()
lr = LogisticRegression()

# Logestic Regression

In [41]:
gender_submission.drop(columns="PassengerId", axis=1, inplace=True)

In [42]:
lr.fit(X, Y)
y_pred = lr.predict(x_test)
print(accuracy_score(gender_submission, y_pred))

0.9138755980861244

# SVC

In [43]:
svc.fit(X, Y)
y_pred = svc.predict(x_test)
print(accuracy_score(gender_submission, y_pred))

0.6411483253588517

# Random forest classifier

In [44]:
rfc.fit(X, Y)
y_pred = rfc.predict(x_test)
print(accuracy_score(gender_submission, y_pred))

0.8660287081339713